eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>DocumentRef.абс_ЗадачаТЭО</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>DocumentRef.абс_ПоступлениеУниверсальныйСклад</types>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>CatalogRef.абс_ТЭО</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_ПеремещениеУниверсальныйСклад</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.абс_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.абс_ИзменениеКонтрагентаВДоговоре</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.абс_ПлановыеРегламентныеРаботы</types>
      <types>DocumentRef.ПеремещениеМатериаловВЭксплуатации</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВЭксплуатацию</types>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>DocumentRef.абс_ЗаявкаНаДобавлениеИзменениеПрав</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
      <types>DocumentRef.абс_ВводЗначенийПоказателейДляРасчетаКПЭ</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.абс_ПереносДанных</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>DocumentRef.абс_АВИЗО</types>
      <types>CatalogRef.абс_ИнструкцииПользователя</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>BusinessProcessRef.абсЗаявкаВПоддержку</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.абс_ВыбытиеУниверсальныйСклад</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.абс_ЗаявкаНаПроект</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИтоговыйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоСчетСканСчетаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗагруженИзИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СвойствоОС</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипДокумента</name>
    <type>
      <types>CatalogRef.абс_ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ХэшФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СсылкаНаАналогичныйФайл</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/CommonModules/абс_РаботаСФайлами/Module.bsl
// Функция получает в параметрах двоичные данные и записывает файл в файловое хранилище на сервере.
// {{ТТК Сладков А. Заявка №7754434  26.10.2016 ++
//Функция ЗаписатьФайлВоВнешнееХранилище(СсылкаОбъекта, ДвоичныеДанные, ИмяФайла, СсылкаФайлаХранилища = Неопределено, КлючСтроки = Неопределено, СвойствоОС = Неопределено) Экспорт
// {{ТТК Сладков А. Заявка №7754434  26.10.2016 --
Функция ЗаписатьФайлВоВнешнееХранилище(СсылкаОбъекта, ДвоичныеДанные, ИмяФайла, СсылкаФайлаХранилища = Неопределено, КлючСтроки = Неопределено, СвойствоОС = Неопределено,ХэшЗагружаемогоФайла=Неопределено) Экспорт
	
	
	
	Если НЕ КонтрольРазмераФайла(ДвоичныеДанные) Тогда
		Возврат Новый Структура("Успешно", Ложь);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Хранилище,Успешно");
	СтруктураВозврата.Вставить("Хранилище","");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	// {{ТТК Сладков А. Заявка №7753726  21.10.2016 ++
	//КаталогХранилищаФайлов = Константы.абс_ПутьКВнешнемуХранилищу.Получить();
	КаталогХранилищаФайлов = ОбщегоНазначенияКлиентСервер.ПолучитьПутьКВнешнемуХранилищуФайловПоОбъектуМетаданных(СсылкаОбъекта);
	// {{ТТК Сладков А. Заявка №7753726  21.10.2016 --

	НаименованиеКаталога = "";
		
	Объект = СсылкаОбъекта;
		
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		
		НаименованиеКаталога = НаименованиеКаталога + "\Прочие файлы";
		
	Иначе
				
		НаименованиеКаталога = НаименованиеКаталога + Строка(Объект.Метаданные().Имя) + "\";
		Если ТипЗнч(СсылкаОбъекта) = Тип("СправочникСсылка.ДоговорыКонтрагентов")Тогда
			Если Объект.Метаданные().Владельцы.Количество() > 0 Тогда
				НаименованиеКаталога = НаименованиеКаталога + РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(
				СокрЛП(Лев(СокрЛП(Объект.Владелец.Код), 50)) + "_" + 
				Строка(Объект.Владелец.УникальныйИдентификатор()));
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Справочники.ТипВсеСсылки().Типы().Найти(ТипЗнч(Объект)) = Неопределено Тогда
		НаименованиеКаталога = НаименованиеКаталога + "\" + 
			РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(
				СокрЛП(Объект.Код) + "_" +
				Строка(Объект.УникальныйИдентификатор()));
			
		Иначе
			НаименованиеКаталога = НаименованиеКаталога + "\" + 
			РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(
			СокрЛП(Объект.Номер) + "_" +
			Строка(Объект.УникальныйИдентификатор()));
			
		КонецЕсли;
			
	КонецЕсли;
		
	Попытка 
		
				
		ПутьКФайлу = КаталогХранилищаФайлов + "\" + НаименованиеКаталога;
		
		СоздатьКаталог(ПутьКФайлу);
				
		Файл = Новый Файл(ПутьКФайлу + "\" + ИмяФайла);
		
		ИмяФайла 	= Файл.ИмяБезРасширения;
		Расширение 	= Файл.Расширение;
		
		ПолныйПутьКФайлу = ПутьКФайлу + "\" + РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(ИмяФайла + Расширение);
				
		Пока Файл.Существует() Цикл
			ПолныйПутьКФайлу = ПутьКФайлу + "\" + РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(ИмяФайла + "_" + Строка(Новый УникальныйИдентификатор) + Расширение);
			Файл = Новый Файл(ПолныйПутьКФайлу);
		КонецЦикла;
		
		СтруктураВозврата.Вставить("Хранилище",Прав(ПолныйПутьКФайлу, СтрДлина(ПолныйПутьКФайлу) - СтрДлина(КаталогХранилищаФайлов)));
		
		// {{ТТК Сладков А. Заявка №7754434 26.10.2016 начало
		
		// Проверим, если аналогичный файл уже имееться в системе тогда вернем ссылку уже ранее созданного элемента
		// Запишем эту ссылку в текущей элемент, и файл будем читать из нее	
		
		
		
		СсылкаНаХранилище_С_АналогичнымФайлом = НайтиДублирующийФайлХранилища(ХэшЗагружаемогоФайла,ИмяФайла); 
		
		Если НЕ ЗначениеЗаполнено(СсылкаНаХранилище_С_АналогичнымФайлом) Тогда
			
		    ДвоичныеДанные.Записать(ПолныйПутьКФайлу);
		
		КонецЕсли;	
		// }}ТТК Сладков А. Заявка №7754434 26.10.2016 окончание

				
		Если НЕ СсылкаФайлаХранилища = Неопределено Тогда			
			ОбъектХранилища = СсылкаФайлаХранилища.ПолучитьОбъект();
		Иначе			
			ОбъектХранилища = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
			ОбъектХранилища.Объект 			= СсылкаОбъекта;
			ОбъектХранилища.абс_КлючСтроки  = КлючСтроки;
			ОбъектХранилища.ИмяФайла 		= ИмяФайла;
			ОбъектХранилища.ВидДанных 		= Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
		КонецЕсли;
				
		// {{ТТК Сладков А. Заявка №7754434 26.10.2016 начало
		Если ЗначениеЗаполнено(СсылкаНаХранилище_С_АналогичнымФайлом) Тогда
			
		    ОбъектХранилища.ttk_СсылкаНаАналогичныйФайл = СсылкаНаХранилище_С_АналогичнымФайлом;
			
		Иначе
			
			Если  НЕ(ХэшЗагружаемогоФайла=Неопределено ИЛИ ХэшЗагружаемогоФайла=0) Тогда

				ОбъектХранилища.ttk_ХэшФайла = ХэшЗагружаемогоФайла;
				
			КонецЕсли;	
			
		КонецЕсли;
		// {{ТТК Сладков А. Заявка №7754434 26.10.2016 окончание
		
		ОбъектХранилища.Хранилище = Новый ХранилищеЗначения(Прав(ПолныйПутьКФайлу, СтрДлина(ПолныйПутьКФайлу) - СтрДлина(КаталогХранилищаФайлов)));
		ОбъектХранилища.Наименование = Файл.Имя;
		ОбъектХранилища.абс_ДатаПрикрепленияФайла = ТекущаяДата();
		
		// Если общий отдел прикрепляет файлы к договору в статус Подписание и регистрация, то файл помечается как итоговый.
		Если ТипЗнч(СсылкаОбъекта) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			Если СсылкаОбъекта.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация И РольДоступна("абс_ОбщийОтдел") Тогда
				
				ОбъектХранилища.абс_ИтоговыйФайл = Истина;	
			КонецЕсли;
		ИначеЕсли ТипЗнч(СсылкаОбъекта) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
            //для ОС файлы принадлежат конретному свойству 
			Если СвойствоОС <> Неопределено Тогда 
				ОбъектХранилища.абс_СвойствоОС = СвойствоОС;
			КонецЕсли;
		КонецЕсли;

		ОбъектХранилища.Записать();
		
	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Ошибка загрузки файлов: " + ОписаниеОшибки());
		//Возврат Ложь;
		СтруктураВозврата.Вставить("Успешно",Ложь);
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	СтруктураВозврата.Вставить("ХранилищеСсылка", ОбъектХранилища.Ссылка);
	СтруктураВозврата.Вставить("Успешно",Истина);
	Возврат СтруктураВозврата;	
	
КонецФункции

// Функция по ссылка на хранилище файлов и возвращает двоичные данные.
Функция ПолучитьФайлИзВнешнегоХранилища(СсылкаФайла) Экспорт
	
	// {{ТТК Сладков А. Заявка №7754434  26.10.2016 ++
	Если ЗначениеЗаполнено(СсылкаФайла.ttk_СсылкаНаАналогичныйФайл) Тогда
		
		СсылкаФайла = СсылкаФайла.ttk_СсылкаНаАналогичныйФайл;
		
	КонецЕсли;
	// {{ТТК Сладков А. Заявка №7754434  26.10.2016 --

	Если ТипЗнч(СсылкаФайла.Хранилище.Получить()) = Тип("Строка") Тогда
		
		// {{ТТК Сладков А. Заявка №7753726  21.10.2016 ++
		//ПутьКФайлу = Константы.абс_ПутьКВнешнемуХранилищу.Получить() + "/" + СсылкаФайла.Хранилище.Получить();
		ПутьКФайлу = ОбщегоНазначенияКлиентСервер.ПолучитьПутьКВнешнемуХранилищуФайлов(СсылкаФайла) + "/" + СсылкаФайла.Хранилище.Получить();
		// {{ТТК Сладков А. Заявка №7753726  21.10.2016 -
			
		 
		 
		 Возврат Новый ДвоичныеДанные(ПутьКФайлу);
	КонецЕсли;		

КонецФункции

Функция КонтрольРазмераФайла(ДвоичныеДанные)
	
	МаксимальныйРазмерФайлаМБ = Константы.абс_МаксимальныйРазмерФайла.Получить();
	
	РазмерФайлаБайтыМБ = Окр(ДвоичныеДанные.Размер() / 1024 / 1024, 3);
	
	Если РазмерФайлаБайтыМБ > МаксимальныйРазмерФайлаМБ Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Превышен максимальный размер прикрепляемого файла.");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОтбиратьИтоговыеФайлыДоговора(ДоговорКонтрагентаСсылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Объект
	|	И ХранилищеДополнительнойИнформации.абс_ИтоговыйФайл = ИСТИНА");
	
	Запрос.УстановитьПараметр("Объект", ДоговорКонтрагентаСсылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

//Функция получает данные из хранилища значений из реквизита по ссылке
//
Функция ПолучитьПутькФайлуВоВнешнемХранилище(СсылкаФайла) Экспорт 
	
	
	// {{ТТК Сладков А. Заявка №7753726  21.10.2016 ++
	//ПутьКФайлу = Константы.абс_ПутьКВнешнемуХранилищу.Получить() + "/" + СсылкаФайла.Хранилище.Получить();
	ПутьКФайлу = ОбщегоНазначенияКлиентСервер.ПолучитьПутьКВнешнемуХранилищуФайлов(СсылкаФайла) + "/" + СсылкаФайла.Хранилище.Получить();
	 // {{ТТК Сладков А. Заявка №7753726  21.10.2016 -
	
	
	Возврат ПутьКФайлу;
	
КонецФункции

Функция ПолучитьРазмерФайла(СсылкаФайла) Экспорт
	
	
	// {{ТТК Сладков А. Заявка №7753726  21.10.2016 ++
	//ПутьКФайлу = Константы.абс_ПутьКВнешнемуХранилищу.Получить() + "/" + СсылкаФайла.Хранилище.Получить();
	ПутьКФайлу = ОбщегоНазначенияКлиентСервер.ПолучитьПутьКВнешнемуХранилищуФайлов(СсылкаФайла) + "/" + СсылкаФайла.Хранилище.Получить();
	// {{ТТК Сладков А. Заявка №7753726  21.10.2016 -

	Попытка 
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		Результат = ДвоичныеДанные.Размер();
	Исключение	
		Возврат ОписаниеОшибки(); 
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// функция формирует имя заменяя из первоначально предложенного имени все
// запрещенные символы на символ в параметре ЗамешающийСимвол
// Параметры
//  ИмяФайла     – Строка, содержащая имя файла, без каталога.
//
// Возвращаемое значение:
//   Строка – имя файла, которое может быть использовано в файловой системе
//
Функция ЗаменитьЗапрещенныеСимволыСтроки(Знач ИмяФайла, ЗамешающийСимвол) Экспорт

	ИтоговоеИмяФайла = СокрЛП(ИмяФайла);
	
	Если ПустаяСтрока(ИтоговоеИмяФайла) Тогда
		
		Возврат ИтоговоеИмяФайла;
		
	КонецЕсли;
	
	СписокСимволов = ПолучитьСписокЗапрещенныхСимволовВИменахФайлов();
	
	Для Каждого СтрокаЗапретногоСимвола  Из СписокСимволов Цикл
		
		ИтоговоеИмяФайла = СтрЗаменить(ИтоговоеИмяФайла,  СтрокаЗапретногоСимвола.Значение, ЗамешающийСимвол);			
		
	КонецЦикла;
	
	Возврат ИтоговоеИмяФайла;

КонецФункции

// функция возвращает список запрещенных символов в именах файлов
// Возвращаемое значение:
//   Список значений в котором хранится список всех запрещенных символов в именах файлов.
//
Функция ПолучитьСписокЗапрещенныхСимволовВИменахФайлов()
	
	СписокСимволов = Новый СписокЗначений();
	
	СписокСимволов.Добавить("\");
	СписокСимволов.Добавить("/");
	СписокСимволов.Добавить(":");
	СписокСимволов.Добавить("*");
	СписокСимволов.Добавить("&");
	СписокСимволов.Добавить("""");
	СписокСимволов.Добавить("<");
	СписокСимволов.Добавить(">");
	СписокСимволов.Добавить("|");
	
	Возврат СписокСимволов;
	
КонецФункции

// {{ТТК Сладков А. Заявка №7754434  26.10.2016 ++
Функция ПолучитьХэшЗагруженногоФайла(ДвоичныеДанныеФайла)
	
   Хеш = Новый ХешированиеДанных(ХешФункция.CRC32);
 
   Хеш.ДобавитьФайл(ДвоичныеДанныеФайла);
 
   Возврат Хеш.ХешСумма; 

	
КонецФункции


Функция НайтиДублирующийФайлХранилища(ХэшЧислоФайла,ИмяФайла)
	
	Если ХэшЧислоФайла=Неопределено ИЛИ ХэшЧислоФайла=0 Тогда
		
		Возврат  Справочники.ХранилищеДополнительнойИнформации.ПустаяСсылка();
		
	КонецЕсли;
	
	Запрос=новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.ttk_ХэшФайла = &ttk_ХэшФайла
	|	И  ХранилищеДополнительнойИнформации.ИмяФайла ПОДОБНО &ИмяФайла";
	
	Запрос.УстановитьПараметр("ttk_ХэшФайла",ХэшЧислоФайла);
	Запрос.УстановитьПараметр("ИмяФайла",ИмяФайла);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка 
		
	Иначе
		
		
		Возврат Справочники.ХранилищеДополнительнойИнформации.ПустаяСсылка(); 
		
	КонецЕсли;
	
	
КонецФункции
// {{ТТК Сладков А. Заявка №7754434  26.10.2016 --
